In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Creating a Data frame

In [ ]:
data = {
   'Name':['qasim','ali','mouzan','hassan'],
   'Age': [18,19,20,21],
    'city':['vehari','burewala','malci','dubai'],
    'Salary':[60000,70000,80000,90000]
}

In [ ]:
df = pd.DataFrame(data)
df

     Name  Age      city  Salary
0   qasim   18    vehari   60000
1     ali   19  burewala   70000
2  mouzan   20     malci   80000
3  hassan   21     dubai   90000

In [ ]:
data_list = [
    ['Qasim',18,'Vehari',88000],
    ['Ali',19,'Burewala',45000],
    ['Mouzan',20,'Malci',70000],
    ['Subhan',21,'Faislabad',67000]
]
colums = ['Name','Age','City','Salary']

In [ ]:
df2 = pd.DataFrame(data_list)
df2 = pd.DataFrame(data_list,columns=colums)
df2

     Name  Age       City  Salary
0   Qasim   18     Vehari   88000
1     Ali   19   Burewala   45000
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
# Selections And Indexing Of Columns

df2

In [ ]:
df2

     Name  Age       City  Salary
0   Qasim   18     Vehari   88000
1     Ali   19   Burewala   45000
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
df2[['Name','City']]

     Name       City
0   Qasim     Vehari
1     Ali   Burewala
2  Mouzan      Malci
3  Subhan  Faislabad

In [ ]:
# Creating a new columns

In [ ]:
df2['Designation'] = ['Doctor','Eng','Operater','Doctor']

In [ ]:
df2

     Name  Age       City  Salary Designation
0   Qasim   18     Vehari   88000      Doctor
1     Ali   19   Burewala   45000         Eng
2  Mouzan   20      Malci   70000    Operater
3  Subhan   21  Faislabad   67000      Doctor

In [ ]:
df2.drop(['Age','City'],axis =1 )

     Name  Salary
0   Qasim   88000
1     Ali   45000
2  Mouzan   70000
3  Subhan   67000

In [ ]:
df2

     Name  Age       City  Salary
0   Qasim   18     Vehari   88000
1     Ali   19   Burewala   45000
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
df2.drop(0,axis=0)

     Name  Age       City  Salary
1     Ali   19   Burewala   45000
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
#  Selecting a rows

df2

In [ ]:
df2.loc[[0,1]]

    Name  Age      City  Salary
0  Qasim   18    Vehari   88000
1    Ali   19  Burewala   45000

In [ ]:
df2.iloc[3]

Name         Subhan
Age              21
City      Faislabad
Salary        67000
Name: 3, dtype: object

Selecting subset of rows and columns

In [ ]:
df2.loc[[0,1]][['City','Salary']]

       City  Salary
0    Vehari   88000
1  Burewala   45000

In [ ]:
df2.loc[[2,3]][['Name','Age']]

     Name  Age
2  Mouzan   20
3  Subhan   21

In [ ]:
# Conditional Selection >,<,== ,!=

In [ ]:
df2

     Name  Age       City  Salary
0   Qasim   18     Vehari   88000
1     Ali   19   Burewala   45000
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
# I only Want to see those people whose age is above 30

In [ ]:
df2[df2['Age'] > 19]

     Name  Age       City  Salary
2  Mouzan   20      Malci   70000
3  Subhan   21  Faislabad   67000

In [ ]:
#  I only want to people age is above 19 and their city must b faislabad

In [ ]:
df2[(df2['Age'] > 19)] & (df2['City'] == 'Faislabad')